xdrMessageFactory/src/main/resources/DeliveryStatusNotification_success.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
   xmlns:a="http://www.w3.org/2005/08/addressing">
   <soapenv:Header xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
      <direct:metadata-level xmlns:direct="urn:direct:addressing">minimal</direct:metadata-level>
      <direct:addressBlock xmlns:direct="urn:direct:addressing"
         soapenv:role="urn:direct:addressing:destination"
         soapenv:relay="true">
         <direct:from>#DIRECT_FROM#</direct:from>
         <direct:to>#DIRECT_TO#</direct:to>
         <direct:notification relatesTo="#DIRECT_RELATESTO#"/>         
      </direct:addressBlock>
      <wsa:To soapenv:mustUnderstand="true" xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
         xmlns:wsa="http://www.w3.org/2005/08/addressing"
         >#WSA_TO#</wsa:To>
      <wsa:MessageID soapenv:mustUnderstand="true"
         xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
         xmlns:wsa="http://www.w3.org/2005/08/addressing"
         >#MESSAGE_ID#</wsa:MessageID>
      <wsa:Action soapenv:mustUnderstand="true"
         xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
         xmlns:wsa="http://www.w3.org/2005/08/addressing"
         >urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wsa:Action>
   </soapenv:Header>
   <soapenv:Body xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
      <xdsb:ProvideAndRegisterDocumentSetRequest xmlns:xdsb="urn:ihe:iti:xds-b:2007">
         <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
            <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
               <rim:ExtrinsicObject id="#ENTRY_UUID#"
                  mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
                  <rim:Name>
                     <rim:LocalizedString value="DocA"/>
                  </rim:Name>
                  <rim:Description/>
                  <rim:ExternalIdentifier
                     identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab"
                     value="1.42.20140915172101.10.1"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                     id="id_12" registryObject="#ENTRY_UUID#">
                     <rim:Name>
                        <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
                     </rim:Name>
                  </rim:ExternalIdentifier>
               </rim:ExtrinsicObject>
               <rim:RegistryPackage id="id_package"
                  objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
                  <rim:Slot name="submissionTime">
                     <rim:ValueList>
                        <rim:Value>20110117211159</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="intendedRecipient">
                     <rim:ValueList>
                        <rim:Value>Some
                           Hospital^^^^^^^^^1.2.3.4.5.6.7.8.9.1789.45|^Wel^Marcus^^^Dr^MD|^^Internet^mwel@healthcare.example.org</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Classification
                     classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d"
                     classifiedObject="id_package"
                     nodeRepresentation=""
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="id_13">
                     <rim:Slot name="authorTelecommunication">
                        <rim:ValueList>
                           <rim:Value>^^Internet^john.doe@healthcare.example.org</rim:Value>
                        </rim:ValueList>
                     </rim:Slot>
                  </rim:Classification>
                  <rim:ExternalIdentifier
                     identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8"
                     value="1.42.20140915172101.11"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                     id="id_15" registryObject="id_package">
                     <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
                     </rim:Name>
                  </rim:ExternalIdentifier>
                  <rim:ExternalIdentifier id="fefcba76-ab23-4138-96ce-795f02b26d79"
                     registryObject="id_package"
                     identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832"
                     value="1.2.840.114350.1.13.252.1.7.2.688879">
                     <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
                     </rim:Name>
                  </rim:ExternalIdentifier>
               </rim:RegistryPackage>
               <rim:Classification classifiedObject="id_package"
                  classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"
                  id="urn:uuid:c6e5bf3c-3e5b-4777-bfcd-85e5c66328e1"
                  objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
               <rim:Association
                  associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember"
                  sourceObject="id_package"
                  targetObject="#ENTRY_UUID#"
                  id="id_association"
                  objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association">
                  <rim:Slot name="SubmissionSetStatus">
                     <rim:ValueList>
                        <rim:Value>Original</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
               </rim:Association>
            </rim:RegistryObjectList>
         </lcm:SubmitObjectsRequest>
         <xdsb:Document id="id_doc"
            >            
            <direct:messageDisposition xmlns:direct="urn:direct:addressing"> 
               <direct:recipient>#DIRECT_RECIPIENT#</direct:recipient>
               <direct:disposition>success</direct:disposition>
            </direct:messageDisposition>            
         </xdsb:Document>
      </xdsb:ProvideAndRegisterDocumentSetRequest>
   </soapenv:Body>
</s:Envelope>

